nateihle/AmazonHarmonyIntegration/harmony/v2_06/framework/peripheral/mcpwm/processor/mcpwm_p32mk1024mcf100.h
/* Created by plibgen $Revision: 1.31 $ */

#ifndef _MCPWM_P32MK1024MCF100_H
#define _MCPWM_P32MK1024MCF100_H

/* Section 1 - Enumerate instances, define constants, VREGs */

#include <xc.h>
#include <stdbool.h>

#include "peripheral/peripheral_common_32bit.h"

/* Default definition used for all API dispatch functions */
#ifndef PLIB_INLINE_API
    #define PLIB_INLINE_API extern inline
#endif

/* Default definition used for all other functions */
#ifndef PLIB_INLINE
    #define PLIB_INLINE extern inline
#endif

#define _MCPWM_BASE_ADDRESS 	 0xBF82A000
#define _MCPWM_CHANNEL_OFFSET 	 0xBF82A0C0
#define _MCPWM_CHANNEL_SIZE 	 0x00000100

typedef enum {

    MCPWM_ID_0 = _MCPWM_BASE_ADDRESS,
    MCPWM_NUMBER_OF_MODULES = 1

} MCPWM_MODULE_ID;

typedef enum {

    MCPWM_CHANNEL1 = _MCPWM_CHANNEL_OFFSET+0*_MCPWM_CHANNEL_SIZE,
    MCPWM_CHANNEL2 = _MCPWM_CHANNEL_OFFSET+1*_MCPWM_CHANNEL_SIZE,
    MCPWM_CHANNEL3 = _MCPWM_CHANNEL_OFFSET+2*_MCPWM_CHANNEL_SIZE,
    MCPWM_CHANNEL4 = _MCPWM_CHANNEL_OFFSET+3*_MCPWM_CHANNEL_SIZE,
    MCPWM_CHANNEL5 = _MCPWM_CHANNEL_OFFSET+4*_MCPWM_CHANNEL_SIZE,
    MCPWM_CHANNEL6 = _MCPWM_CHANNEL_OFFSET+5*_MCPWM_CHANNEL_SIZE,
    MCPWM_CHANNEL7 = _MCPWM_CHANNEL_OFFSET+6*_MCPWM_CHANNEL_SIZE,
    MCPWM_CHANNEL8 = _MCPWM_CHANNEL_OFFSET+7*_MCPWM_CHANNEL_SIZE,
    MCPWM_CHANNEL9 = _MCPWM_CHANNEL_OFFSET+8*_MCPWM_CHANNEL_SIZE,
    MCPWM_CHANNEL10 = _MCPWM_CHANNEL_OFFSET+9*_MCPWM_CHANNEL_SIZE,
    MCPWM_CHANNEL11 = _MCPWM_CHANNEL_OFFSET+10*_MCPWM_CHANNEL_SIZE,
    MCPWM_CHANNEL12 = _MCPWM_CHANNEL_OFFSET+11*_MCPWM_CHANNEL_SIZE,
    MCPWM_NUMBER_OF_CHANNELS = 12

} MCPWM_CHANNEL_ID;

typedef enum {

    MCPWM_TRIGGER_DIVIDE_BY_1 = 0,
    MCPWM_TRIGGER_DIVIDE_BY_2 = 1,
    MCPWM_TRIGGER_DIVIDE_BY_3 = 2,
    MCPWM_TRIGGER_DIVIDE_BY_4 = 3,
    MCPWM_TRIGGER_DIVIDE_BY_5 = 4,
    MCPWM_TRIGGER_DIVIDE_BY_6 = 5,
    MCPWM_TRIGGER_DIVIDE_BY_7 = 6,
    MCPWM_TRIGGER_DIVIDE_BY_8 = 7,
    MCPWM_TRIGGER_DIVIDE_BY_9 = 8,
    MCPWM_TRIGGER_DIVIDE_BY_10 = 9,
    MCPWM_TRIGGER_DIVIDE_BY_11 = 10,
    MCPWM_TRIGGER_DIVIDE_BY_12 = 11,
    MCPWM_TRIGGER_DIVIDE_BY_13 = 12,
    MCPWM_TRIGGER_DIVIDE_BY_14 = 13,
    MCPWM_TRIGGER_DIVIDE_BY_15 = 14,
    MCPWM_TRIGGER_DIVIDE_BY_16 = 15

} MCPWM_TRIGGER_DIVIDER;

typedef enum {

    MCPWM_CLOCK_DIVIDE_BY_1 = 0,
    MCPWM_CLOCK_DIVIDE_BY_2 = 1,
    MCPWM_CLOCK_DIVIDE_BY_4 = 2,
    MCPWM_CLOCK_DIVIDE_BY_8 = 3,
    MCPWM_CLOCK_DIVIDE_BY_16 = 4,
    MCPWM_CLOCK_DIVIDE_BY_32 = 5,
    MCPWM_CLOCK_DIVIDE_BY_64 = 6,
    MCPWM_CLOCK_DIVIDE_BY_128 = 7

} MCPWM_CLOCK_DIVIDER;

typedef enum {

    MCPWM_CHOP_CLOCK_DISABLE = 0,
    MCPWM_CHOP_CLOCK_ENABLE = 1

} MCPWM_CHOP_CLOCK_CONTROL;

typedef enum {

    MCPWM_TIME_BASE_SOURCE_PRIMARY = 0,
    MCPWM_TIME_BASE_SOURCE_SECONDARY = 1

} MCPWM_TIME_BASE_SOURCE;

typedef enum {

    MCPWM_TIME_BASE_SYNCHRONIZED = 0,
    MCPWM_TIME_BASE_INDEPENDENT = 1

} MCPWM_TIME_BASE_MODE;

typedef enum {

    MCPWM_EDGE_ALIGNED = 0,
    MCPWM_SYMMETRIC_CENTER_ALIGNED = 1,
    MCPWM_ASYMMETRIC_CENTER_ALIGNED = 2,
    MCPWM_ASYMMETRIC_CENTER_ALIGNED_WITH_SIMULTANEOUS_UPDATE = 3

} MCPWM_ALIGNMENT_MODE;

typedef enum {

    MCPWM_OUTPUT_COMPLIMENTARY_MODE = 0,
    MCPWM_OUTPUT_REDUNDANT_MODE = 1,
    MCPWM_OUTPUT_PUSH_PULL_MODE = 2,
    MCPWM_OUTPUT_LOW_LATCHED_TO_ZERO = 3

} MCPWM_OUTPUT_MODE;

typedef enum {

    MCPWM_PWMxH_ACTIVEHIGH = 0,
    MCPWM_PWMxH_ACTIVELOW = 1

} MCPWM_PWMxH_OUTPUT_POLARITY;

typedef enum {

    MCPWM_PWMxL_ACTIVEHIGH = 0,
    MCPWM_PWMxL_ACTIVELOW = 1

} MCPWM_PWMxL_OUTPUT_POLARITY;

typedef enum {

    MCPWM_DEADTIME_POSITIVE = 0,
    MCPWM_DEADTIME_NEGATIVE = 1,
    MCPWM_DEADTIME_DISABLE = 2,
    MCPWM_DEADTIME_COMPENSATION_ENABLED = 3

} MCPWM_DEADTIME_MODE;

typedef enum {

    MCPWM_DEADTIME_COMPENSATION_POLARITY_ACTIVE_HIGH = 0,
    MCPWM_DEADTIME_COMPENSATION_POLARITY_ACTIVE_LOW = 1

} MCPWM_DEADTIME_COMPENSATION_POLARITY;

typedef enum {

    MCPWM_TIMER_INCREMENTING = 0,
    MCPWM_TIMER_DECREMENTING = 1

} MCPWM_TIMER_DIRECTION;

typedef enum {

    MCPWM_PRIMARY_TRIGGER_DURING_TIMER_INCREMENTING_DECREMENTING = 0,
    MCPWM_PRIMARY_TRIGGER_DURING_TIMER_DECREMENTING = 1,
    MCPWM_PRIMARY_TRIGGER_DURING_TIMER_INCREMENTING = 2

} MCPWM_PRIMARY_TRIGGER_CYCLE_SELECT;

typedef enum {

    MCPWM_SECONDARY_TRIGGER_DURING_TIMER_INCREMENTING_DECREMENTING = 0,
    MCPWM_SECONDARY_TRIGGER_DURING_TIMER_DECREMENTING = 1,
    MCPWM_SECONDARY_TRIGGER_DURING_TIMER_INCREMENTING = 2

} MCPWM_SECONDARY_TRIGGER_CYCLE_SELECT;

typedef enum {

    MCPWM_ADC_TRIGGER_SOURCE_PRIMARY = 0,
    MCPWM_ADC_TRIGGER_SOURCE_PRIMARY_SECONDARY = 1

} MCPWM_ADC_TRIGGER_SOURCE;

typedef enum {

    MCPWM_TRIGGER_INTERRUPT_SOURCE_PRIMARY = 0,
    MCPWM_TRIGGER_INTERRUPT_SOURCE_SECONDARY = 1

} MCPWM_TRIGGER_INTERRUPT_SOURCE;

typedef enum {

    MCPWM_FAULT_INPUT_LEB_DISABLE = 0,
    MCPWM_FAULT_INPUT_LEB_ENABLE = 1

} MCPWM_FAULT_INPUT_LEB_CONTROL;

typedef enum {

    MCPWM_CURRENTLIMIT_INPUT_LEB_DISABLE = 0,
    MCPWM_CURRENTLIMIT_INPUT_LEB_ENABLE = 1

} MCPWM_CURRENTLIMIT_INPUT_LEB_CONTROL;

typedef enum {

    MCPWM_CHOP_CLOCK_SOURCE_IS_CHOP_CLOCK_GENERATOR = 0,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW1H = 1,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW2H = 2,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW3H = 4,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW4H = 5,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW5H = 6,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW6H = 7,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW7H = 8,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW8H = 9,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW9H = 10,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW10H = 11,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW11H = 12,
    MCPWM_CHOP_CLOCK_SOURCE_IS_PMW12H = 13

} MCPWM_CHOP_CLOCK_SOURCE;

typedef enum {

    MCPWM_PWMxH_CHOP_DISABLED = 0,
    MCPWM_PWMxH_CHOP_ENABLED = 1

} MCPWM_PWMxH_CHOP_CONTROL;

typedef enum {

    MCPWM_PWMxL_CHOP_DISABLED = 0,
    MCPWM_PWMxL_CHOP_ENABLED = 1

} MCPWM_PWMxL_CHOP_CONTROL;

typedef enum {

    MCPWM_CURRENTLIMIT_SOURCE_IS_FLT1 = 0,
    MCPWM_CURRENTLIMIT_SOURCE_IS_FLT2 = 1,
    MCPWM_CURRENTLIMIT_SOURCE_IS_FLT3 = 2,
    MCPWM_CURRENTLIMIT_SOURCE_IS_FLT4 = 3,
    MCPWM_CURRENTLIMIT_SOURCE_IS_FLT5 = 4,
    MCPWM_CURRENTLIMIT_SOURCE_IS_FLT6 = 5,
    MCPWM_CURRENTLIMIT_SOURCE_IS_FLT7 = 6,
    MCPWM_CURRENTLIMIT_SOURCE_IS_FLT8 = 7,
    MCPWM_CURRENTLIMIT_SOURCE_IS_COMPARATOR1 = 8,
    MCPWM_CURRENTLIMIT_SOURCE_IS_COMPARATOR2 = 9,
    MCPWM_CURRENTLIMIT_SOURCE_IS_COMPARATOR3 = 10,
    MCPWM_CURRENTLIMIT_SOURCE_IS_COMPARATOR4 = 11,
    MCPWM_CURRENTLIMIT_SOURCE_IS_COMPARATOR5 = 12,
    MCPWM_CURRENTLIMIT_SOURCE_IS_FLT15 = 15

